examples/of7/kOmegaSST/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

kappa               0.4;
Cmu                 0.09;
Uref                10.0;
Zref                20.0;
zDir                (0 0 1);
flowDir             (1 0 0);
z0                  0.01;
zGround             uniform 0.0;


// Calculate ABL friction velocity U*
ustar               #calc "$Uref*$kappa / log(($Zref+$z0) / $z0)";

// ************************************************************************* //

// Curve-fitting coefficients for TKE profile
// A*log((z + z0)/z) + B*sqr((z + z0)/z0) + C(z + z0)/z0)+ D + E*log(z + z0)
// Note: If Zmax is large, code may fail due to negative value under sqrt

A               0;
B               0;
C               0;
D               -0.5;
E               4;

// // For Richards and Hoxey (1993) profiles: A=B=C=0; D=ustar^2/sqrt(Cmu)
// // For Parente et al 2011 profile:  A = A_parente; B=C=0; D=A_parente*ln(z0)+B_parente
// A             0;
// B                    0;
// C                    0;
// D                    #calc  "pow($ustar,2) / pow(0.09,0.5)"; // Richards Hoxey
// E                    0;


Etke            $E;      // Same parameter as E. Renamed Etke in wall function code to avoid conflict with (Edash=9.793)

// ************************************************************************* //

BW              0;        // Flag for alternative TKE profile (0: Eq.7 Balogh et al)
hABL            1;        // TKE profile parameter, used when BW is selected

// Blending coefficient
blendCoeff      0;        // Blending coefficient "alpha" in Eq.22 Bellegoni et al (2023). blendCoeff = 0 for homogenous ABL

//Upper limits on CmuMax/betaStarMax. May affect homogeniety at upper end of domain if small
CmuMax          0.35;     // Upper limit for Cmu (for kEpsilon)
betaStarMax     0.35;     // Upper limit for betaStarMax (for OmegaSST)

// Wall function parameters
roughWall       1;       // Flag for wall functions (1 = Rough wall)
kappaWF         $kappa;  // Kappa parameter in wall function. Set = kappa.

// Turbulence model constant in Wake field (e.g. building influence area).
// No effect when blendCoeff = 0
WFCmu           0.09;    // Cmu in Wake Field (for kEpsilon)
WFbetaStar      0.09;    // betaStar in Wake Field (for OmegaSST)

// Upper limits on deltaU, deltaK and deltaE (Eq. 23 Bellegoni 2023)
// No effect when blendedCoeff = 0 
thresholdU      5;
thresholdE      5;
thresholdK      5;
thresholdO      5;

// Attenuation parameter to avoid over-extending of Building Influence Area (BIA). (=1/A in Eq. 23 of Bellegoni et al (2023))?
// No effect when blendedCoeff = 0 
constantU       1;        // Au = 1
constantE       10;       // Ak = 0.1
constantK       10;       // Ae = 0.1
constantO       10;       // Ae = 0.1
